
#### Terraform Format and Style 🖌`failure`
<details><summary>Format Output</summary>

```

rust.auto.tfvars
--- old/rust.auto.tfvars
+++ new/rust.auto.tfvars
@@ -1,2 +1,2 @@
 projectName = "rust"
-location = "eastus"
+location    = "eastus"

```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_backup_policy_vm.rust will be created
  + resource "azurerm_backup_policy_vm" "rust" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "rust-recovery-vault-policy"
      + policy_type                    = "V1"
      + recovery_vault_name            = "rust-recovery-vault"
      + resource_group_name            = "rust"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "04:00"
        }

      + retention_daily {
          + count = 7
        }
    }

  # azurerm_backup_protected_vm.vm1 will be created
  + resource "azurerm_backup_protected_vm" "vm1" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rust-recovery-vault"
      + resource_group_name = "rust"
      + source_vm_id        = (known after apply)
    }

  # azurerm_linux_virtual_machine.rust will be created
  + resource "azurerm_linux_virtual_machine" "rust" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "rust"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rust"
      + size                                                   = "Standard_B2als_v2"
      + virtual_machine_id                                     = (known after apply)

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # azurerm_log_analytics_workspace.rust will be created
  + resource "azurerm_log_analytics_workspace" "rust" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus2"
      + name                            = "rust-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rust"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_network_interface.rust will be created
  + resource "azurerm_network_interface" "rust" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = true
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "nic-rust"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rust"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.rust will be created
  + resource "azurerm_network_security_group" "rust" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-rust"
      + resource_group_name = "rust"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "28015",
                  + "28017",
                ]
              + direction                                  = "Inbound"
              + name                                       = "RustUDP"
              + priority                                   = 105
              + protocol                                   = "Udp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "28016",
                  + "28082",
                ]
              + direction                                  = "Inbound"
              + name                                       = "RustTCP"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.rust will be created
  + resource "azurerm_public_ip" "rust" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-rust"
      + resource_group_name     = "rust"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
    }

  # azurerm_recovery_services_vault.rust will be created
  + resource "azurerm_recovery_services_vault" "rust" {
      + classic_vmware_replication_enabled = (known after apply)
      + cross_region_restore_enabled       = false
      + id                                 = (known after apply)
      + immutability                       = (known after apply)
      + location                           = "eastus"
      + name                               = "rust-recovery-vault"
      + public_network_access_enabled      = true
      + resource_group_name                = "rust"
      + sku                                = "Standard"
      + soft_delete_enabled                = false
      + storage_mode_type                  = "LocallyRedundant"
    }

  # azurerm_subnet.rust will be created
  + resource "azurerm_subnet" "rust" {
      + address_prefixes                               = [
          + "10.0.0.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-internal"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rust"
      + virtual_network_name                           = "vnet-rust"
    }

  # azurerm_subnet_network_security_group_association.rust will be created
  + resource "azurerm_subnet_network_security_group_association" "rust" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.rust will be created
  + resource "azurerm_virtual_network" "rust" {
      + address_space       = [
          + "10.0.0.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-rust"
      + resource_group_name = "rust"
      + subnet              = (known after apply)
    }

  # tls_private_key.ssh_key will be created
  + resource "tls_private_key" "ssh_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @robpitcher, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*